<template>
  <div class="useragreement expand border-top-1px">
    <div class="content">
      欢迎使用智慧琴童服务，为保障用户权益，请用户在付费之前，详细阅读此服务协议（以下简称“本协议”）所有内容，特别是加粗部分。当用户点选“【我已经阅读并同意《用户付费协议》】”的，即表示用户同意并承诺遵守本协议。
    </div>
    <div class="content">
      本协议内容包括协议正文、本协议下述明确援引的其他协议，智慧琴童已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
    </div>
    <div class="title">第一条 定义</div>
    <div class="content">
      1、智慧琴童所有和经营的有关教育、学习等数字内容聚合、管理和分发的平台产品，旨在为课程发布者及用户提供教学内容的生成、传播和学习等平台服务。<br>
      2、收费课程是指课程发布者发布至智慧琴童，有偿提供给用户的视频、文字、图片等内容。<br>
      3、收费证书是指课程发布者通过智慧琴童平台向完成指定课程学习并完成课程考核的用户有偿提供的课程证书。<br>
      4、课程发布者是指经智慧琴童审核同意后，通过云课堂平台有偿向用户提供服务或发布其享有合法权益的内容供用户学习、使用的自然人、法人、其他组织。<br>
第二条 本协议的修订
    </div>
    <div class="title">第二条 本协议的修订</div>
    <div class="content">
      <strong>智慧琴童有权对本协议进行调整或补充，并在智慧琴童官网公告。若用户继续使用智慧琴童服务的，则视为接受该等调整或补充，亦或用户有权终止使用该服务。</strong>
    </div>
    <div class="title">第三条 云课堂服务规范</div>
    <div class="content">
      <strong>1、 智慧琴童作为平台提供方，为课程发布者及用户提供平台服务。课程发布者通过云课堂平台可以为用户提供有偿服务或内容（包括但不限于收费课程、收费证书等所有收费类型的服务和内容，下同），云课堂并非该等有偿服务或内容的提供方或售卖方。</strong><br>
      <strong>2、智慧琴童不参与用户与课程发布者的交易。对于任何直接或间接的、实质或非实质的由于有偿服务或内容造成的损失或纠纷，云课堂不承担责任，但将根据云课堂的相关规则为用户提供必要的客户服务。</strong> <br>
      3、除非另有证明，智慧琴童储存在其服务器上的数据是用户使用云课堂服务的唯一有效证据。
    </div>
    <div class="title">第四条 用户规则</div>
    <div class="content">
      1、用户可在智慧琴童上浏览课程发布者发布的内容信息（包括但不限于收费课程信息、收费证书申请信息等），如用户希望有偿获得该部分内容或服务，则用户需先登录或注册网易邮箱帐号或通过页面提示,选用其他第三方帐号进行登录。如用户选用其他第三方帐号进行登录的，用户应保证第三方帐号的稳定性、真实性以及可用性，如因第三方帐号原因（如第三方帐号被封号）致使用户无法登录云课堂的，用户应与第三方帐号的所属公司联系。用户在使用智慧琴童服务时登录的帐号是智慧琴童确认用户身份的唯一依据。<br>
      2、用户理解并同意：课程发布者通过云课堂平台提供有偿内容或服务实行先付款后使用的方式，用户及时、足额、合法的支付所需的款项是您使用该等有偿内容或服务的前提。<br>
      3、用户理解并同意，课程发布者通过云课堂平台发布的收费课程将采用整体购买的方式，即用户只需购买一次，就可以学习该课程所有已发布或即将发布的课时。已购买的收费课程，用户可以自己重复学习，无需再次付费。<strong>但请用户注意，在符合相关法律、法规规定的情况下，智慧琴童有权根据上述规定对您购买的收费课程不予退款。</strong><br>
      <strong>4、用户知悉并同意，用户无权对已购买的课程进行出售、转让、许可或其他方式使除用户自己以外的第三方（包括但不限于自然人、法人或其他组织）使用其已购买的课程。若用户违反本条规定，则智慧琴童有权视情况采取如下措施：</strong><br>
      <strong>4.1取消用户继续使用该课程的权利；</strong> <br>
      <strong>4.2 限制/冻结用户的帐号；</strong> <br>
      <strong>4.3 要求用户退还其通过出售、转让、许可等其他方式取得的收益；</strong> <br>
      <strong>4.4其他智慧琴童可以采取的救济措施。</strong> <br>
      <strong>5、用户了解并同意，课程发布者可能会基于自身原因（包括但不限于：更新课程内容、改进课程安排）不定期的对收费课程进行更新而无需经过您的事先同意。</strong> <br>
      <strong>6、用户知悉并同意，课程发布者针对课程的不同设置，将按照课程需要提供收费证书，每门课程对应的证书申请规则会因课程发布方设置的不同而有不同。因此收费证书的申请规则以及是否支持退款等内容请查看该门课程详情页中的具体规则。</strong> <br>
      <strong>7、用户知悉并同意，用户通过云课堂平台支付的款项由提供有偿内容或服务的课程发布者收取，若您需要获取相关凭据，应联系课程发布者或渠道商（包括但不限于Apple等）解决。</strong> <br>
      8、用户应保管好自己的帐号和密码，如因用户未保管好自己的帐号和密码而对自己、智慧琴童或第三方造成损害的，用户将负全部责任。另外，用户应对用户帐号中的所有活动和事件负全责。用户可随时改变帐号和密码。用户同意若发现有非法使用用户的帐号或出现安全漏洞的情况，立即通告云课堂，智慧琴童将会尽力予以妥善解决。
    </div>
    <div class="title">第五条  其他约定</div>
    <div class="content">
      1、所有权及知识产权：智慧琴童平台上所有内容，包括但不限于文字、软件、声音、图片、录像、图表、网站架构、网站画面的安排、网页设计、以及有偿内容或服务均由智慧琴童、课程发布者或其他权利人依法拥有其知识产权，包括但不限于著作权、商标权、专利权等。非经云课堂、课程发布者或其他权利人书面同意用户不得擅自使用、修改、复制、传播、改变、散布、发行或发表上述内容。如有违反，用户同意承担由此给智慧琴童、课程发布者或其他权利人造成的一切损失。<br>
      2、通知：所有发给用户的通知都可通过电子邮件、常规的信件或在网站显著位置公告的方式进行传送。<br>
      3、本协议适用中华人民共和国的法律（不含冲突法）。当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关内容将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。 <br>
      4、本协议自发布之日起实施，并构成用户和云课堂之间的共识。 <br>
      5、智慧琴童不行使、未能及时行使或者未充分行使本协议或者按照法律规定所享有的权利，不应被视为放弃该权利，也不影响云课堂在将来行使该权利。 <br>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
.useragreement{
  text-align: left;
  padding-top: 20px;
}
.title{
  color: #2E2F37;
  font-size: 14px;
  font-weight: 600;
  line-height: 24px;
  margin-bottom: 10px;
}
.content{
  font-size: 13px;
  color: #84858B;
  line-height: 22px;
  margin-bottom: 20px;
}
</style>
